Revit 2024 API
StructuralSectionISplitParallelFlange Class
 Defines parameters for I-split Parallel Flange structural section.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public class StructuralSectionISplitParallelFlange : StructuralSectionGeneralT
Visual Basic
Public Class StructuralSectionISplitParallelFlange _
	Inherits StructuralSectionGeneralT
Visual C++
public ref class StructuralSectionISplitParallelFlange : public StructuralSectionGeneralT
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangular
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionHotRolled
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralT
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionISplitParallelFlange
See Also
StructuralSectionISplitParallelFlange Members
Autodesk.Revit.DB.Structure.StructuralSections Namespace